// Задача 3.
// Напишите программу, которая принимает на вход число
// (N) и выдает таблицу квадратов чисел от 1 до N. 
// 
// 5 - 1, 4, 9, 16, 25
// 2 - 1, 4


// try
// {
//     Console.Write("Введите число: ");
//     int num = Convert.ToInt32(Console.ReadLine());
//     for (int i = 1; i <= num; i++)
// {
//     Console.Write($"{i * i} ");
// }
// }

//  catch
// {
//     Console.WriteLine("Нужно ввести целое число. Повторите попытку, введите целое число.");
// }

Console.Write("Введите число: ");
double num = double.Parse(Console.ReadLine()!);












