// 3. Напишите программу, которая на вход принимает одно число
// (N), а на выходе показывает все целые числа в промежутке от -N до N.


Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine()!);

// int num1 = -num;
int count = 0;

while (count <= num);
{Console.WriteLine(count);
count++;
}





